Repository: La3ziz20/Flutter-based_mobile_application
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Eco Game Suite
ar: مجموعة الألعاب البيئية

# welcomeMessage
source: Welcome to Eco Hero!
ar: مرحباً بك في بطل البيئة!

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# guestMode
source: Continue as Guest
ar: المتابعة كضيف

source: Dashboard
ar: لوحة التحكم

source: Eco Points
ar: النقاط البيئية

source: Play
ar: العب

# settingsTitle
source: Settings
ar: الإعدادات

source: Change Language
ar: تغيير اللغة

# ecoHeroTitle
source: Eco Hero
ar: بطل البيئة

# ecoHeroScore
source: Score: {score}
ar: النقاط: {score}

# climateCombatTitle
source: Smog Buster
ar: مكافح التلوث

# cityChallengeTitle
source: Waste Catcher
ar: جامع النفايات

# waterCleanupTitle
source: Water Cleanup
ar: تنظيف المياه

source: Tap to Play
ar: انقر للعب

source: Game Over
ar: انتهت اللعبة

source: Paused
ar: موقوف

# plantTrees
source: Plant Trees (-CO2)
ar: ازرع شجرة (-CO2)

# buildIndustry
source: Build Industry (+CO2)
ar: بناء مصنع (+CO2)

# guestUser
source: Guest Eco-Warrior
ar: محارب بيئي ضيف

# dailyEcoTipTitle
source: Daily Eco Tip
ar: نصيحة بيئية يومية

# dailyEcoTipContent
source: Did you know? Recycling one aluminum can saves enough energy to run a TV for 3 hours!
ar: هل تعلم؟ إعادة تدوير علبة ألومنيوم واحدة يوفر طاقة كافية لتشغيل تلفاز لمدة 3 ساعات!

# playAndLearn
source: Play & Learn
ar: العب وتعلم

# ecoHeroDesc
source: Clean the world!
ar: نظف العالم!

# smogBusterDesc
source: Strategy for change.
ar: استراتيجية للتغيير.

# wasteCatcherDesc
source: Build the future.
ar: ابنِ المستقبل.

# waterCleanupDesc
source: Save the ocean!
ar: أنقذ المحيط!

# timeLabel
source: Time: {time} s
ar: الوقت: {time} ث

# highScoreLabel
source: High: {score}
ar: الأفضل: {score}

# co2Label
source: CO2: {value} ppm
ar: ثاني أكسيد الكربون: {value} جزء بالمليون

# tempLabel
source: Temp: {value}Â°C
ar: الحرارة: {value} درجة مئوية

source: OK
ar: حسناً

# gameOverMessage
source: Your Score: {score} High Score: {highScore}
ar: نقاطك: {score} أفضل نقاط: {highScore}

# chatTitle
source: Eco Chat
ar: المحادثة البيئية

# chatHint
source: Ask me about nature...
ar: اسألني عن الطبيعة...

# botGreeting
source: Hello! I'm here to help you save the planet.
ar: مرحباً! أنا هنا لمساعدتك في حماية الكوكب.

source: Send
ar: إرسال

source: You
ar: أنت

source: Eco Bot
ar: بوت البيئة
